## Plan Result (688: zr_sbox_acr - TerraformPlanApply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-aks-kubelet-ptl-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-aks-kubelet-sbox-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-jenkins-cftptl-intsvc-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-jenkins-ptl-mi-push&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-jenkins-ptl-mi-reader&#34;]
* Delete
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-aks-kubelet-ptl-mi&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-aks-kubelet-sbox-mi&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-jenkins-cftptl-intsvc-mi&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-jenkins-ptl-mi-pull&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.zr_acr["hmctssbox-aks-kubelet-ptl-mi"] will be destroyed
  # (because key ["hmctssbox-aks-kubelet-ptl-mi"] is not in for_each map)
  - resource "azurerm_role_assignment" "zr_acr" {
      - id                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox/providers/Microsoft.Authorization/roleAssignments/d831d000-130e-9327-b598-58d8bbb8e0ca" -> null
      - name                                   = "d831d000-130e-9327-b598-58d8bbb8e0ca" -> null
      - principal_id                           = "7a6762ce-8a4f-4496-b7e5-08ea2f55bbc4" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
      - role_definition_name                   = "AcrPull" -> null
      - scope                                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-aks-kubelet-ptl-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7a6762ce-8a4f-4496-b7e5-08ea2f55bbc4"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-aks-kubelet-sbox-mi"] will be destroyed
  # (because key ["hmctssbox-aks-kubelet-sbox-mi"] is not in for_each map)
  - resource "azurerm_role_assignment" "zr_acr" {
      - id                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox/providers/Microsoft.Authorization/roleAssignments/035b4e74-d1bd-531c-9ec5-7d54016afe76" -> null
      - name                                   = "035b4e74-d1bd-531c-9ec5-7d54016afe76" -> null
      - principal_id                           = "fd657beb-8e34-42f2-9cc7-f9016a065849" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
      - role_definition_name                   = "AcrPull" -> null
      - scope                                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-aks-kubelet-sbox-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fd657beb-8e34-42f2-9cc7-f9016a065849"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-jenkins-cftptl-intsvc-mi"] will be destroyed
  # (because key ["hmctssbox-jenkins-cftptl-intsvc-mi"] is not in for_each map)
  - resource "azurerm_role_assignment" "zr_acr" {
      - id                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox/providers/Microsoft.Authorization/roleAssignments/05b1b8e8-ccb8-c1df-e0b4-2768073a90ef" -> null
      - name                                   = "05b1b8e8-ccb8-c1df-e0b4-2768073a90ef" -> null
      - principal_id                           = "ca6d5085-485a-417d-8480-c3cefa29df31" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
      - role_definition_name                   = "AcrPull" -> null
      - scope                                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-jenkins-cftptl-intsvc-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-jenkins-ptl-mi-pull"] will be destroyed
  # (because key ["hmctssbox-jenkins-ptl-mi-pull"] is not in for_each map)
  - resource "azurerm_role_assignment" "zr_acr" {
      - id                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox/providers/Microsoft.Authorization/roleAssignments/cabfcc56-b263-e73b-854c-b7e0ebd93411" -> null
      - name                                   = "cabfcc56-b263-e73b-854c-b7e0ebd93411" -> null
      - principal_id                           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
      - role_definition_name                   = "AcrPull" -> null
      - scope                                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-jenkins-ptl-mi-push"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-jenkins-ptl-mi-reader"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":39,"Program":"tfcmt","SHA1":"","Target":"688: zr_sbox_acr - TerraformPlanApply","Vars":{}} -->